Hi @janik-cloudflare I've updated my code to set `priority = null` but the drift still occurs for other attributes

```
  # module.dns.module.acme_com.module.webmail.cloudflare_dns_record.record[0] will be updated in-place
  ~ resource "cloudflare_dns_record" "record" {
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-08-25T12:38:26Z" -> (known after apply)
        id                  = "1d927d0603ca2955be57bc1e2241ca8c"
      ~ modified_on         = "2025-08-25T12:38:26Z" -> (known after apply)
      ~ name                = "webmail.acme.com" -> "webmail"
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        }
        tags                = []
      + tags_modified_on    = (known after apply)
        # (7 unchanged attributes hidden)
    }
```

Any ideas? Based on previous comments I believe I'm not the only one experiencing these issues